/*****************************************************
 * DIAGMULMATRIX.H
 * 实现矩阵相乘 *
 * 实现矩阵采样 *
 * 实现规则点生成 *
 * 实现二维矩阵转为一维矩阵 *
 * Author:lwj  Created on May 18th, 2023 *
 *****************************************************/
#ifndef _DIAGMULMATRIX_H_
#define _DIAGMULMATRIX_H_

#include <vector>
using namespace std;

int **MulMatrix(int m, int *phi, int col, int **Phi);
/*-----------------------------------------------------
 *	Function: 实现（三维观测系统/二维矩阵）线间采样
 *	Input:
 *		m -- 矩阵的行  phi -- 采样矩阵
 *		col -- 矩阵的列  Phi -- 二维矩阵
 *	Output:
 *		线间采样后的二维矩阵
 *-----------------------------------------------------*/
int *MulMatrix_1D(int N, int *phi, int *Phi);//对一维矩阵进行采样
/*-----------------------------------------------------
 *	Function: 实现一维矩阵采样
 *	Input:
 *		N -- 一维矩阵总数  phi -- 采样矩阵
 *		Phi -- 规则坐标数据的一维矩阵
 *	Output:
 *		采样后的实际坐标
 *-----------------------------------------------------*/
 float *MulMatrix_1D_float(int N, int *phi, float *Phi);//对一维矩阵进行采样
 /*-----------------------------------------------------
 *	Function: 实现一维矩阵采样
 *	Input:
 *		N -- 一维矩阵总数  phi -- 采样矩阵
 *		Phi -- 规则坐标数据的一维矩阵
 *	Output:
 *		采样后的实际坐标
 *-----------------------------------------------------*/

float *RegularMR(int row, int col, float d, float X0=489000);//检波点横坐标
/*-----------------------------------------------------
 *	Function: 实现规则三维观测系统---检波点横坐标
 *	Input:
 *		row -- 矩阵的行  d -- 最小道间距
 *		col -- 矩阵的列
 *	Output:
 *		规则的检波点横坐标
 *-----------------------------------------------------*/
float *RegularNR(int row, int col, float d, float Y0=3461000);//检波点纵坐标
/*-----------------------------------------------------
 *	Function: 实现规则三维观测系统---检波点纵坐标
 *	Input:
 *		row -- 矩阵的行  d -- 线距
 *		col -- 矩阵的列
 *	Output:
 *		规则的检波点纵坐标
 *-----------------------------------------------------*/
float *RegularMS(int row,int col, float d, float SX0=491375);
/*-----------------------------------------------------
 *	Function: 实现规则三维观测系统---炮点横坐标
 *	Input:
 *		row -- 矩阵的行  d -- 最小道间距
 *		col -- 矩阵的列
 *	Output:
 *		规则的炮点横坐标
 *-----------------------------------------------------*/
float *RegularNS(int row,int col, float d, float SY0=3462025);
/*-----------------------------------------------------
 *	Function: 实现规则三维观测系统---炮点纵坐标
 *	Input:
 *		row -- 矩阵的行  d -- 线距
 *		col -- 矩阵的列
 *	Output:
 *		规则的炮点纵坐标
 *-----------------------------------------------------*/
int *Convert1D(int row,int col,int **phi);
/*-----------------------------------------------------
 *	Function: 实现将二维数组转化为一维,int类型,按照行读取排列
 *	Input:
 *		row -- 矩阵的行  phi -- 二维矩阵
 *		col -- 矩阵的列
 *	Output:
 *		长为row*col大小的一维矩阵
 *-----------------------------------------------------*/

float *Convert1D_float(int row,int col,float **phi);
/*-----------------------------------------------------
*	Function: 实现将二维数组转化为一维,float类型,按照行读取排列
*	Input:
*		row -- 矩阵的行  phi -- 二维矩阵
*		col -- 矩阵的列
*	Output:
*		长为row*col大小的一维矩阵
*-----------------------------------------------------*/

#endif 